output/2023-07-31-15-01.log
Benchmark_Config
1000,100,1024
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /Echo/echo
Document Length:        1044 bytes

Concurrency Level:      100
Time taken for tests:   0.178 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      1208000 bytes
Total body sent:        1207000
HTML transferred:       1044000 bytes
Requests per second:    5602.93 [#/sec] (mean)
Time per request:       17.848 [ms] (mean)
Time per request:       0.178 [ms] (mean, across all concurrent requests)
Transfer rate:          6609.71 [Kbytes/sec] received
                        6604.24 kb/s sent
                        13213.94 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.5      0       7
Processing:     0   11  29.1      1     120
Waiting:        0   11  29.1      1     120
Total:          0   12  30.4      1     122
Benchmark_Config
1000,100,1024
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /Echo/echo
Document Length:        1044 bytes

Concurrency Level:      100
Time taken for tests:   0.057 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      1208000 bytes
Total body sent:        1207000
HTML transferred:       1044000 bytes
Requests per second:    17500.57 [#/sec] (mean)
Time per request:       5.714 [ms] (mean)
Time per request:       0.057 [ms] (mean, across all concurrent requests)
Transfer rate:          20645.20 [Kbytes/sec] received
                        20628.11 kb/s sent
                        41273.31 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.8      0       3
Processing:     1    5   4.1      3      17
Waiting:        1    5   4.1      3      17
Total:          1    5   4.8      3      20
Benchmark_Config
1000,100,2048
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /Echo/echo
Document Length:        2068 bytes

Concurrency Level:      100
Time taken for tests:   0.057 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      2232000 bytes
Total body sent:        2231000
HTML transferred:       2068000 bytes
Requests per second:    17503.02 [#/sec] (mean)
Time per request:       5.713 [ms] (mean)
Time per request:       0.057 [ms] (mean, across all concurrent requests)
Transfer rate:          38151.11 [Kbytes/sec] received
                        38134.02 kb/s sent
                        76285.13 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.8      0       3
Processing:     1    5   4.9      4      20
Waiting:        1    5   4.9      4      20
Total:          1    5   5.7      4      22
Benchmark_Config
1000,100,4096
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /Echo/echo
Document Length:        4116 bytes

Concurrency Level:      100
Time taken for tests:   0.064 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      4280000 bytes
Total body sent:        4279000
HTML transferred:       4116000 bytes
Requests per second:    15650.68 [#/sec] (mean)
Time per request:       6.389 [ms] (mean)
Time per request:       0.064 [ms] (mean, across all concurrent requests)
Transfer rate:          65414.94 [Kbytes/sec] received
                        65399.65 kb/s sent
                        130814.59 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.1      0       5
Processing:     1    6   3.6      5      16
Waiting:        1    5   3.6      5      16
Total:          1    6   4.7      5      20
Benchmark_Config
1000,100,8192
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /Echo/echo
Document Length:        8212 bytes

Concurrency Level:      100
Time taken for tests:   0.066 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      8376000 bytes
Total body sent:        8375000
HTML transferred:       8212000 bytes
Requests per second:    15151.52 [#/sec] (mean)
Time per request:       6.600 [ms] (mean)
Time per request:       0.066 [ms] (mean, across all concurrent requests)
Transfer rate:          123934.66 [Kbytes/sec] received
                        123919.86 kb/s sent
                        247854.52 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.0      0       5
Processing:     1    6   3.0      5      18
Waiting:        1    6   3.0      5      18
Total:          1    6   3.6      5      22
Benchmark_Config
1000,100,16384
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /Echo/echo
Document Length:        16404 bytes

Concurrency Level:      100
Time taken for tests:   0.098 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      16569000 bytes
Total body sent:        16568000
HTML transferred:       16404000 bytes
Requests per second:    10204.29 [#/sec] (mean)
Time per request:       9.800 [ms] (mean)
Time per request:       0.098 [ms] (mean, across all concurrent requests)
Transfer rate:          165112.19 [Kbytes/sec] received
                        165102.22 kb/s sent
                        330214.41 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.3      0       5
Processing:     1    8   5.4      7      27
Waiting:        0    8   5.5      7      27
Total:          1    9   6.6      7      31
Benchmark_Config
1000,100,32768
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /Echo/echo
Document Length:        32788 bytes

Concurrency Level:      100
Time taken for tests:   0.169 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      32953000 bytes
Total body sent:        32952000
HTML transferred:       32788000 bytes
Requests per second:    5912.58 [#/sec] (mean)
Time per request:       16.913 [ms] (mean)
Time per request:       0.169 [ms] (mean, across all concurrent requests)
Transfer rate:          190270.64 [Kbytes/sec] received
                        190264.87 kb/s sent
                        380535.51 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.8      0       3
Processing:     2   16   7.1     17      44
Waiting:        1   16   7.2     16      44
Total:          2   16   7.3     17      44
Benchmark_Config
1000,100,65536
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /Echo/echo
Document Length:        65556 bytes

Concurrency Level:      100
Time taken for tests:   0.213 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      65721000 bytes
Total body sent:        65720000
HTML transferred:       65556000 bytes
Requests per second:    4691.53 [#/sec] (mean)
Time per request:       21.315 [ms] (mean)
Time per request:       0.213 [ms] (mean, across all concurrent requests)
Transfer rate:          301105.63 [Kbytes/sec] received
                        301101.04 kb/s sent
                        602206.67 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.9      0      10
Processing:     2   19  10.5     17      53
Waiting:        2   19  10.5     17      53
Total:          2   20  11.7     17      63